[
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 90,
        "line_count": 1,
        "language": "English",
        "tags": [
            "Influencer",
            "LinkedIn"
        ]
    },
    {
        "text": "Jobseekers, this one’s for you.\n Every application, every interview, every follow-up… the pressure is immense.\n And I know what you're thinking: Am I not good enough? \n But let me tell you, this isn’t about you or your skills. It’s about a broken system where 60% of applicants never hear back. \n Your mental health is not worth sacrificing for a system that doesn’t acknowledge your worth. \n Please remember, taking care of yourself is the real priority. \n Your dream job will come, but for now, breathe. 🌻",
        "engagement": 347,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Job Search",
            "MentalHealth"
        ]
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 109,
        "line_count": 1,
        "language": "English",
        "tags": [
            "jobs",
            "online dating"
        ]
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' \n The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 115,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Job Search",
            "LinkedIn Scams"
        ]
    },
    {
        "text": "sapne dekhna achi baat hai,\nlekin job ka sapna dekh ke 'interested' likhna,\nyeh toh achi baat nahi hai na?",
        "engagement": 545,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Career Advice",
            "Humor"
        ]
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line.\nIf there's a link attached to it, it's most probably a fake one.\nSaves me time!",
        "engagement": 188,
        "line_count": 3,
        "language": "English",
        "tags": [
            "linkedin",
            "productivity"
        ]
    },
    {
        "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. The sleepless nights, the endless preparation, all for nothing.\n\nBut looking back, I realize it wasn’t nothing. It was the Universe’s way of saying, “Not this one, something better is on the way.”\n\nEvery single time, I’ve been shown why that rejection happened.\n\nDoors I thought I wanted to walk through were shut, only to have the right ones swing open.\n\nThe kind that aligned with my growth, my values, and my happiness.\n\nAt first, it stung. It hurt deeply. But now, when things don’t go as planned, I don’t panic.\n\nI don’t question my worth. I sit back, breathe, and trust. The Universe knows.\n\nI know there's another plan waiting. Something bigger, better, and just for me.\n\nTo anyone feeling the weight of rejection: trust that the closed doors are protecting you from something you can’t see right now.\n\nYour path is being cleared for something even more beautiful.",
        "engagement": 206,
        "line_count": 16,
        "language": "English",
        "tags": [
            "Inspiration",
            "Motivation"
        ]
    },
    {
        "text": "To everyone who's still looking for a job...\n\nI see you. I feel you. 💔\n\nEvery rejection email feels like a punch in the gut, and every 'We'll get back to you' sounds more like 'You'll never hear from us.'\n\nBut I want you to know, you're not alone in this. 🌸\n\nAccording to a study, 80% of jobseekers struggle with anxiety and self-doubt during their search. It's normal to feel lost, but it's not the end.\n\nTake breaks, breathe, and remember, this doesn't define you. Your worth is not tied to an offer letter. 💥\n\nYour mental health matters more than any job.",
        "engagement": 899,
        "line_count": 9,
        "language": "English",
        "tags": [
            "jobsearch",
            "mentalhealth"
        ]
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. It’s easy to get caught up in the 'big company = big talent' mindset, but that's not always the case.\n\nI’ve had the privilege of working with people from smaller companies (lesser known) who blow me away with their skills and dedication. They don’t need a fancy title or a famous brand behind them to prove their worth.\n\nI've seen the other side too—people in top-tier companies feeling lost, overwhelmed, or stuck, even though the world sees them as 'successful'.\n\nLet’s stop attaching someone’s value to the company they work for. Freshers especially need to hear this—skills are what matter, not the size of the company behind them.\n\nAt the end of the day, happiness and growth don’t come from a brand name, they come from doing what you love and constantly improving your craft.",
        "engagement": 166,
        "line_count": 9,
        "language": "English",
        "tags": [
            "careeradvice",
            "motivation"
        ]
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good 😯\n\nI just said-\n\n'Hope your son gets a manager like you.\nI hope that the manager behaves the same way as you did with me.\nThank you.'\n\nNow tell me 1 thing-\n\nShe always said that she was a great manager.\nWhy will she get offended?\n\nI just told her that I wish her son would get a manager like she was.\n\nIf you felt bad, then that means you were a bad manager and now you know it. 🦄\n\nIf you feel good, then take it as a blessing for your son and you'll really want someone to treat your son/daughter in the same way.\n\nShe cannot be even angry with me else it'll prove that she was not a 'great' manager.\n\nMuskan - 1\nManager - 0\n\nMuskan -> Aura +100000000\n\n(Fictional message unfortunately :(\n)\n\nHope you all become the people that your sons/daughters will like to work under 🙏\n\nThere are a lot of bad people/things, bring a small change and break the chain :)",
        "engagement": 1111,
        "line_count": 15,
        "language": "Hinglish",
        "tags": [
            "motivation",
            "leadership"
        ]
    },
    {
        "text": "OpenAI released their Agents SDK to build multi-agent apps...\n\nRowboat makes it ridiculously simple to use with Nocode.\n\nAnd it's 100% Opensource.\n\nBuilding multi-agent systems usually meant:\n→ Wrestling with complex code\n→ Spending days on configuration\n→ Managing integrations manually\n\nNot anymore.\nRowboat is a Nocode IDE that lets you build multi-agent apps in English.\n\nHere's what makes it powerful:\n1. Natural language agent creation\n↳ Just describe what you need, and the AI builds it for you.\n\n2. MCP tool integration\n↳ Import tools from any MCP server with a few clicks.\n\n3. RAG capabilities built-in\n↳ Connect your knowledge bases instantly.\n\n4. Production-ready deployment\n↳ HTTP API and Python SDK ready to go.\n\nThe most impressive part?\nYou can go from idea to working multi-agent system in minutes.\nNo complex coding required.\n\nYou simply describe what you need: 'Build me an assistant for a food delivery company to handle delivery status and missing items.'\n\nAnd the copilot does the heavy lifting:\n→ Creates appropriate agents\n→ Sets up instructions\n→ Configures connections between them\n→ Stays context-aware for refinements\n\nNo more technical headaches.\n\nThe best part?\nYou can connect MCP servers directly in settings and import tools into your workflow instantly.\n\nWhen you're ready to go live, grab your project ID and API key - then integrate via HTTP API or Python SDK.\n\nThis isn't just another tool. It's a complete rethinking of how we build AI systems.\n\nI have created 50+ AI Agent, RAG tutorials and opensourced them for free: \n\nTwo simple steps to get started:\n1. Subscribe to Unwind AI (for free): theunwindai.com\n2. Star the repo: https://lnkd.in/dW6b_dEn\n\nNew AI Agents and RAG tutorials added every week.\n\nP.S. I create AI Agent tutorials and opensource them for free. Your like and  repost helps keep me going.\n\nDon't forget to follow me Shubham Saboo for daily tips and tutorials on LLMs, RAG and AI Agents.",
        "engagement": 638,
        "line_count": 26,
        "language": "English",
        "tags": [
            "AI",
            "RAG"
        ]
    },
    {
        "text": "Recruitment is no longer just about filling roles—it's about building futures.\nIn today’s fast-moving talent landscape, we’re not just hiring for today’s needs—we’re hiring for tomorrow’s impact.\nIt’s about identifying potential, not just credentials.\nIt’s about aligning values, not just matching job descriptions.\nIt’s about creating a workplace where people don’t just work—they belong, grow, and thrive.\nAs HR professionals, we have the privilege (and responsibility) to shape the future of work—one meaningful hire at a time.\nWhat’s one shift you’ve made in your recruitment strategy that made a big impact? Let’s exchange ideas!\nhashtag#TalentAcquisition hashtag#FutureOfWork hashtag#HRLeadership hashtag#StrategicHiring hashtag#PeopleAndCulture hashtag#RecruitmentInsights",
        "engagement": 51,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Future of Work",
            "Talent Acquisition"
        ]
    },
    {
        "text": "Hello hashtag#Connections,\nwe are hashtag#Hiring !!!\n\nRole - Application Packaging\nExperience - 7+ years\nLocation - Pune\nNP - Immediate to 30 Days\n\nJob Description:\n- As a L2 resource of his/her team, he/she:\n- Technical review and assessment of applications\n- Support and troubleshooting technical issues and complex application.\n- Packaging applications in MSI format using Admin Studio\n- Virtualize applications using App-V\n- Packaging applications for Citrix environment\n- Deploy Applications using SCCM, Altiris.\n- Provisioning and administrating virtual desktops.\n- Ensuring Process and SLA adherence\n- Train and mentor new team members\n- Create the PowerShell scripts for the package configuration\n- Willing to work in Shifts as required\n- Supporting VDI infrastructure\n- Managing VDI infrastructure – Building \\ Assignment \\ Managing \\ Troubleshooting\n- Supports his/her team during diagnosis whenever required\n- Guarantees the production readiness for day to day operations.\n- Actively learn new technologies and technology trends which is getting incorporated into CA-CIB environment.\n- Perform health checks as defined and take respective actions\n- Responsible for service request, incidents and other tasks\n\nKey Responsibilities:\n- Proficient in Windows 10, Windows Server 2k12R2 , 2k16 and 2k22 operating systems and good knowledge of file system and registries\n- Good in technical troubleshooting and problem solving.\n- Familiarity in using VMWare Workstation\n- Expert in VB and PowerShell scripting\n- Use deployment tools to deploy packages\n- Creating packages for Citrix environment\n- Create process documents and checklists for packaging\n- Experience in handling Driver, Add-In applications\n- Experience on packaging tools like ORCA, ProcMon, Picture Taker\n- Publish applications in Citrix farm\n- Test the application using Citrix client\n- Troubleshoot packaged application issues on Citrix environment and fix them\n- Knowledge on Active Directory\n- Proficient in ITIL frame work\n- Experienced in handling complex and very complex applications\n- Must have expert Knowledge in application packaging, Application Compatibility testing and Software Distribution\n- Should be able to handle all technical customer escalations\n- Experienced in Altiris, SCCM\n- Experienced in application virtualization App-V 4.6 and 5.1\n- Experienced in creating the Virtual machine and assigning it to user using XenDesktop 7.15\n- Experienced in troubleshooting the Network flows using nexthink.\n- Should have knowledge on Firewall, clusters and related components.\n- Experienced in supporting the VDI infrastructure using Citrix XenDesktop 7.15\n\nInterested can share their Cvs to mamatha@globexdigitalcorp.com\n\nhashtag#like hashtag#share hashtag#comment hashtag#follow\nhashtag#network hashtag#VDI hashtag#Applicationpackaging hashtag#networkflows hashtag#citrixdesktop\nhashtag#globex hashtag#firewall hashtag#clusters hashtag#nexthink hashtag#Altris hashtag#sccm",
        "engagement": 1000,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Application Packaging",
            "VDI"
        ]
    },
    {
        "post": "Thrilled to Share! \nI had the privilege of participating in a thought-provoking panel discussion on 'CONNECTING CORPORATE TO CLASSROOM' as part of Tech Nexus - Strategy Forum, organized by the School of Computer Science and Engineering at IILM University, Greater Noida, India, on April 25, 2025.\nThe discussion, brilliantly led by Dr. Gunjan Mittal, with incredible support from Dr. Rajeev Tiwari, shed light on bridging the gap between academia and industry. Exploring innovative strategies to prepare students for real-world challenges was an enlightening experience!\nA huge thank you to IILM University and the organizers for hosting such an impactful event. Connecting corporate insights with classroom aspirations truly paves the way for a brighter future in tech education.\nhashtag#TechNexus hashtag#PanelDiscussion hashtag#CorporateToClassroom hashtag#EducationInnovation hashtag#IILMUniversity hashtag#TCS hashtag#MetaVerse911",
        "engagement": 10,
        "line_count": 1,
        "language": "English",
        "tags": [
            "hackathon",
            "panel discussion"
        ]
    },
    {
        "post": "Hi All,\n\nWe are hashtag#hiring for Multiple Positions in hashtag#EY\n\nView Latest Jobs- https://lnkd.in/dW-MhBtN\n\nEligibility Criteria \n* Salary Range: 5 to 18 LPA\n* Job Types: WFH/WFO/Remote\n* Location - India.\n* Fresher's can apply.\n* Good Communication Skills required.\n\nOpen positions- Frontend Developer, Backend Developer, Mobile Developer, UI/UX Designer, Data Analyst / Data Science, Web Development\n\nPlease hit like or comment so that I can review your profile.\n\nWe will look at your Linkedin profile and will let you know of any possible requirements that match your profile.\n\nThank you",
        "engagement": 356,
        "line_count": 1,
        "language": "English",
        "tags": [
            "jobs",
            "hiring"
        ]
    },
    {
        "post": "Had a great time at the Build with AI event at Google Office, Gurgaon, organized by TensorFlow User Group Ghaziabad (TFUG Ghaziabad)!\n\nSome key takeaways from the insightful keynotes:\n\n- Bhavesh B. shared the history of LLMs, the origin of GQL, and use cases of MS GRAG (GRAG was new for me!).\n\n- Nitin Tiwari discussed the latest multimodal models, especially VLMs like PaliGemma, and their use cases.\n\n- A deep dive into Dockerization and Google Cloud applications.\n\nOverall, it was exciting to see NCR's tech community growing and engaging.\n\nBhavesh's keynote, in particular, was really interesting!\n\nLooking forward to more such sessions!\n\nhashtag#events hashtag#ai hashtag#gurgaon",
        "engagement": 50,
        "line_count": 8,
        "language": "English",
        "tags": [
            "AI",
            "events"
        ]
    },
    {
        "post": "Hackathons fuel innovation, teamwork, and sleepless nights — and Hackcraft 2.0 was all of that and more!\nSuper excited to share that Team DESI GEEKS (YES TWIN WE ARE DESI AND GEEKED) — comprising myself, Abhinav Birla, and Diptanil Sarkar — participated in Hackcraft 2.0, an electrifying hackathon hosted at Global Institute of Technology and Management, Gurgaon, on April 5–6.\nWe challenged ourselves to build something meaningful with AI — and after 24 hours of ideating, building, and debugging, we’re proud to say we made it to the Top 20 teams.\n\nThe Hackathon Experience\nThe energy of those final few hours, the satisfaction of getting everything to click, and the support from each other and the mentors — that’s what hackathons are all about.\n\nKey Takeaways\n- Collaboration is everything – Having the right people on your team changes the game.\n- Smart execution beats flashy ideas – Getting things to work under pressure is a win.\n- Learn as you build – Whether it’s code, design, or just handling chaos, it all adds up.\n- Vibes matter – From the night-long grind to random 3 AM convos with other teams, wandering around in the campus at late night with bro, the memories are real.\n\nBuilding Real Connections\nOne of the best parts of this experience was meeting some fantastic developers and tech enthusiasts, sharing knowledge, swapping ideas, and just vibing over shared goals. It’s wild how quickly strangers become teammates in a space like this.\n\nLooking Ahead\nHuge shoutout to the organizers, mentors, volunteers, and every team that pulled up — the energy was unmatched.\nCan’t wait to take this momentum into the next one.\n\nhashtag#Hackcraft2.0 hashtag#HackathonExperience hashtag#AI hashtag#Innovation hashtag#CodingWeekend hashtag#Teamwork hashtag#DevLife hashtag#Networking hashtag#BuilderMindset hashtag#GurgaonTech hashtag#Hackathon",
        "engagement": 19,
        "line_count": 16,
        "language": "English",
        "tags": [
            "hackathon",
            "AI",
            "teamwork"
        ]
    },
    {
        "post": "AI Community Day Delhi – A Power-Packed Experience!\nI had an incredible time attending AI Community Day Delhi, organized by TensorFlow User Group (TFUG) on February 22 at International Technology Park, Gurugram (Sector 59)! Being part of TensorFlow Delhi’s second event was an inspiring blend of cutting-edge AI discussions, hands-on learning sessions, and meaningful networking with industry leaders and peers.\n\nKey Takeaways & Highlights\nOpening Note & Quizzes by Loveleen Kaur Ma’am:\nThe event kicked off with a powerful and motivating session that truly set the tone—feeling like I was waking up to endless possibilities! The interactive quizzes made it engaging, competitive, and a lot of fun!\n\nInsights from Anukriti Bansal Ma’am:\nI dived deep into the world of prototyping and building AI applications using Gemini.\nGained a clear understanding of LLM training and how multimodality turns prompts and colors into compelling images.\n\nBreakthroughs with Rishiraj Acharya Sir:\nExperienced a live demonstration of a real-time multimodal AI chat and learned about the breakthroughs of Gemini 1.5.\nExplored innovative concepts like WebRTC for seamless peer-to-peer AI communication across browsers and servers.\n\nCoding Tips from Anubhav Singh Sir:\nPicked up practical strategies for productive Python coding and got introduced to Flash 2.5—a game changer for writing efficient, scalable AI-powered code!\n\nFun, Learning & Rewards:\nThe quizzes and games, all brilliantly managed by Loveleen Kaur Ma’am, kept the energy high throughout the day.\nI was thrilled to participate in the quiz, and winning TensorFlow stickers was an added bonus!\nIt was exciting to see so many attendees taking home TensorFlow T-shirts as rewards for their participation.\n\nNetworking, Food & Inspiration:\nI had the opportunity to meet some incredible professionals—people whose expertise and journey I truly admire and aspire to emulate.\nThe networking conversations were eye-opening and provided valuable insights for my career growth.\nAnd, of course, the delicious pizza and cold drinks added the perfect touch to the overall experience!\n\nThis event wasn’t just about AI—it was about personal growth, innovation, and building lasting connections. I’m excited to continue learning from this vibrant community and to participate in more such events in the future!\n\nA special shoutout to all the fantastic friends I made. Let’s keep the AI conversations going!\n\nhashtag#AICommunityDay hashtag#TFUGDelhi hashtag#GeminiAI hashtag#AI hashtag#ML hashtag#Networking hashtag#CareerGrowth hashtag#Innovation hashtag#Inspiration",
        "engagement": 25,
        "line_count": 20,
        "language": "Hinglish",
        "tags": [
            "events",
            "workshops"  
        ]
    },
    {
        "post": "Introducing Comment Toxicity: AI-Powered Toxic Comment Detection\nThe internet is a powerful space for connection, but unfortunately, it can also be a breeding ground for toxic interactions. To tackle this issue, I built Comment Toxicity, a machine learning-powered solution designed to detect and classify toxic comments with high accuracy.\n\nWhat it does:\nIdentifies multiple types of toxicity (hate speech, threats, insults, etc.)\nLeverages advanced ML models for classification\nProvides a Gradio-based user-friendly interface for real-time testing\n\nPotential Use Cases:\nContent moderation for social media & forums\nEnhancing community guidelines enforcement\nEnsuring healthier online interactions\n\nFuture Scope:\nReal-time detection for live chat & social media\nMultilingual support for wider accessibility\nAdvanced explain ability features to interpret results\nAPI deployment for seamless integration\n\nCheck out the project & contribute!\nhttps://lnkd.in/gRsfY5RR\n\nLet's make the internet a safer space together!\n\nhashtag#MachineLearning hashtag#AI hashtag#NLP hashtag#ToxicityDetection hashtag#ContentModeration hashtag#AIForGood hashtag#OpenSource",
        "engagement": 15,
        "line_count": 7,
        "language": "English",
        "tags": [
            "productivity",
            "AI",
            "NLP",
            "github"
        ]
    },
    {
        "post": "Ever found yourself needing to ask an LLM about your project, but the thought of manually copying files over makes you question your career choices?\nWell, I’ve found just what we need! Meet GitIngest—a nifty tool that turns your GitHub repository into a prompt-friendly codebase in seconds.\n\nHere’s why it’s a lifesaver:\nPaste, Ingest, Done: Just drop your repo link, and boom—you’ve got everything formatted and ready for your LLM to digest.\nCustomizable: Skip the fluff—exclude unnecessary files and set size limits to focus on the essentials.\nSave Time & Sanity: No more manual file extractions or wrestling with formats.\n\nHere's their website: https://gitingest.com/\nBonus tip: Replace 'hub' with 'ingest' in any GitHub URL, and you’re all set. Yes, it’s that simple.\n\nI gave it a spin, and honestly? It’s the kind of tool you don’t realize you need until you do. Perfect for debugging, brainstorming, or just making sense of those overly creative repo structures.\n\nCurious? Try it out and let me know what you think!\n\nP.S, from what I've explored, this is still being actively developed and is in its early stages!\n\nhashtag#DevTools hashtag#AI hashtag#OpenSource",
        "engagement": 152,
        "line_count": 11,
        "language": "English",
        "tags": ["github"]
    }
]